Revit 2027 API
MultiReferenceAnnotationOptions.ElementsMatchReferenceCategory Method
 Verifies that all of the elements match the reference category required by the MultiReferenceAnnotationType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ElementsMatchReferenceCategory(
	ICollection<ElementId> elements
)
Public Function ElementsMatchReferenceCategory (
	elements As ICollection(Of ElementId)
) As Boolean
public:
bool ElementsMatchReferenceCategory(
	ICollection<ElementId^>^ elements
)
member ElementsMatchReferenceCategory :
        elements : ICollection<ElementId> -> bool
Parameters
elements ICollection<ElementId>
 The elements to test.
Return Value
Boolean
 True if all the elements match the reference category required by the MultiReferenceAnnotationType.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace